HirokiIshiguro/iot-reference-rx/Projects/boot_loader_ck_rx65n/e2studio_ccrx/lib/rx_bootloader/rx_bootloader.c
/***********************************************************************
*
*  FILE        : rx_bootloader.c
*  DESCRIPTION : RX family secure boot loader (generic).
*
*                Based on the RX65N-RSK amazon-freertos boot_loader reference
*                (projects/renesas/rx65n-rsk/e2studio/boot_loader/src/boot_loader.c),
*                with RX72N Envision Kit extensions available behind config switches.
*
*                MCU-dependent flash addresses are declared in config/<mcu>.h and
*                selected via config/rx_bootloader_config.h.
*
***********************************************************************/
#include <stdio.h>
#include <string.h>

#include "r_smc_entry.h"
#include "r_flash_rx_if.h"
#include "r_sci_rx_if.h"
#include "r_sci_rx_pinset.h"

#include "rx_bootloader.h"
#include "rx_bootloader_private.h"
#include "base64_decode.h"
#include "code_signer_public_key.h"

/* tinycrypt */
#include "tinycrypt/sha256.h"
#include "tinycrypt/ecc.h"
#include "tinycrypt/ecc_dsa.h"
#include "tinycrypt/constants.h"

#if RX_BOOTLOADER_USE_LCD
#include "r_simple_graphic_if.h"
#include "r_simple_glcdc_config_rx_if.h"
#endif

#if RX_BOOTLOADER_USE_PERF_COUNTER
#include "r_cmt_rx_if.h"
#endif

#if RX_BOOTLOADER_USE_DATAFLASH_KEY_STORE
#include "r_simple_filesystem_on_dataflash_if.h"
#endif

/*---------------------------------------------------------------------------------------------------------------------*
 * Derived flash layout values (computed from the per-MCU config)
 *---------------------------------------------------------------------------------------------------------------------*/
#define RX_BOOTLOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS FLASH_CF_LO_BANK_LO_ADDR
#define RX_BOOTLOADER_UPDATE_EXECUTE_AREA_LOW_ADDRESS   FLASH_CF_HI_BANK_LO_ADDR
#define RX_BOOTLOADER_UPDATE_TARGET_BLOCK_NUMBER        \
    (FLASH_NUM_BLOCKS_CF - RX_BOOTLOADER_MIRROR_BLOCK_NUM_FOR_SMALL - RX_BOOTLOADER_MIRROR_BLOCK_NUM_FOR_MEDIUM)
#define USER_RESET_VECTOR_ADDRESS                       (RX_BOOTLOADER_LOW_ADDRESS - 4)

/*---------------------------------------------------------------------------------------------------------------------*
 * Module state
 *---------------------------------------------------------------------------------------------------------------------*/
__STATIC FIRMWARE_UPDATE_CONTROL_BLOCK *firmware_update_control_block_bank0 =
    (FIRMWARE_UPDATE_CONTROL_BLOCK*)RX_BOOTLOADER_UPDATE_EXECUTE_AREA_LOW_ADDRESS;
__STATIC FIRMWARE_UPDATE_CONTROL_BLOCK *firmware_update_control_block_bank1 =
    (FIRMWARE_UPDATE_CONTROL_BLOCK*)RX_BOOTLOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS;
__STATIC LOAD_FIRMWARE_CONTROL_BLOCK   load_firmware_control_block;
__STATIC LOAD_CONST_DATA_CONTROL_BLOCK load_const_data_control_block;

__STATIC uint32_t secure_boot_state = BOOT_LOADER_STATE_INITIALIZING;
__STATIC uint32_t flash_error_code;

/* Handle storage. */
sci_hdl_t                 my_sci_handle;
SCI_RECEIVE_CONTROL_BLOCK sci_receive_control_block;
SCI_BUFFER_CONTROL        sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_TOTAL_NUM];

__STATIC int32_t firmware_verification_sha256_ecdsa(const uint8_t *pucData,
                                                    uint32_t       ulSize,
                                                    const uint8_t *pucSignature,
                                                    uint32_t       ulSignatureSize,
                                                    const uint8_t *local_code_signer_public_key);
__CONST uint8_t  code_signer_public_key[]      = CODE_SIGNER_PUBLIC_KEY_PEM;
__CONST uint32_t code_signer_public_key_length = sizeof(code_signer_public_key);

#if RX_BOOTLOADER_USE_DATAFLASH_KEY_STORE
__CONST uint8_t  code_signer_public_key_label[] = "code signer public key";
#endif

#if RX_BOOTLOADER_USE_PERF_COUNTER
__STATIC uint32_t s_10us_counter;
__STATIC uint32_t s_10us_counter_start_flag;
__STATIC uint32_t sha256_time;
__STATIC uint32_t ecdsa_time;

__STATIC void     reset_10us_counter(void);
__STATIC void     start_10us_counter(void);
__STATIC void     stop_10us_counter(void);
__STATIC uint32_t read_10us_counter(void);

void bootloader_software_timer_handler(void *arg);
#endif

/*---------------------------------------------------------------------------------------------------------------------*
 * Forward declarations
 *---------------------------------------------------------------------------------------------------------------------*/
__STATIC int32_t             secure_boot(void);
__STATIC int32_t             firm_block_read(uint32_t *firmware, uint32_t offset);
__STATIC int32_t             const_data_block_read(uint32_t *const_data, uint32_t offset);
__STATIC uint32_t            sci_expected_receive_size(void);
__STATIC void                bank_swap_with_software_reset(void);
__STATIC void                software_reset(void);
__STATIC const uint8_t      *get_status_string(uint8_t status);
__STATIC void                my_sci_callback(void *pArgs);
__STATIC void                my_flash_callback(void *event);

/***********************************************************************************************************************
* Function Name: rx_bootloader_main
***********************************************************************************************************************/
void rx_bootloader_main(void)
{
    int32_t result_secure_boot;
    nop();

#if RX_BOOTLOADER_USE_LCD
    R_SIMPLE_GLCDC_CONFIG_Open();
    R_SIMPLE_GRAPHIC_Open();
#endif

    while (1)
    {
        result_secure_boot = secure_boot();
        if (BOOT_LOADER_SUCCESS == result_secure_boot)
        {
            /* stop all interrupt completely */
            set_psw(0);
#if RX_BOOTLOADER_USE_LCD
            R_SIMPLE_GRAPHIC_Close();
            R_SIMPLE_GLCDC_CONFIG_Close();
#endif
            R_SCI_Close(my_sci_handle);
            uint32_t addr;
            addr = *(uint32_t *)USER_RESET_VECTOR_ADDRESS;
            ((void (*)())addr)();
            while (1); /* infinite loop */
        }
        else if (BOOT_LOADER_FAIL == result_secure_boot)
        {
            while (1) { /* infinity loop */ }
        }
        else if (BOOT_LOADER_IN_PROGRESS == result_secure_boot)
        {
            continue;
        }
        else
        {
            while (1) { /* infinite loop */ }
        }
    }
}

