HirokiIshiguro/iot-reference-rx/Projects/boot_loader_ck_rx65n/e2studio_ccrx/lib/rx_bootloader/rx_bootloader.c
/***********************************************************************************************************************
* Function Name: secure_boot
* Description  : Bootloader state machine. Called repeatedly from rx_bootloader_main() until it returns
*                BOOT_LOADER_SUCCESS (jump to user program) or BOOT_LOADER_FAIL (halt).
***********************************************************************************************************************/
__STATIC int32_t secure_boot(void)
{
    flash_err_t flash_api_error_code = FLASH_SUCCESS;
    int32_t     secure_boot_error_code = BOOT_LOADER_IN_PROGRESS;
    uint32_t    bank_info = 255;
    flash_interrupt_config_t cb_func_info;
    FIRMWARE_UPDATE_CONTROL_BLOCK *firmware_update_control_block_tmp =
        (FIRMWARE_UPDATE_CONTROL_BLOCK *)load_firmware_control_block.flash_buffer;
    int32_t verification_result = -1;

#if RX_BOOTLOADER_USE_DATAFLASH_KEY_STORE
    uint8_t *local_code_signer_public_key;
    uint32_t local_code_signer_public_key_size;
#else
    const uint8_t *local_code_signer_public_key = code_signer_public_key;
#endif

    switch (secure_boot_state)
    {
        case BOOT_LOADER_STATE_INITIALIZING:
            R_SCI_PinSet_serial_term();

            sci_cfg_t my_sci_config;
            sci_err_t my_sci_err;
#if RX_BOOTLOADER_USE_DATAFLASH_KEY_STORE
            SFD_HANDLE sfd_handle;
#endif
#if RX_BOOTLOADER_USE_PERF_COUNTER
            uint32_t my_cmt_channel;
#endif

            my_sci_config.async.baud_rate    = BSP_CFG_SCI_UART_TERMINAL_BITRATE;
            my_sci_config.async.clk_src      = SCI_CLK_INT;
            my_sci_config.async.data_size    = SCI_DATA_8BIT;
            my_sci_config.async.parity_en    = SCI_PARITY_OFF;
            my_sci_config.async.parity_type  = SCI_EVEN_PARITY;
            my_sci_config.async.stop_bits    = SCI_STOPBITS_1;
            my_sci_config.async.int_priority = BSP_CFG_SCI_UART_TERMINAL_INTERRUPT_PRIORITY;

            my_sci_err = R_SCI_Open(SCI_CH_serial_term, SCI_MODE_ASYNC, &my_sci_config, my_sci_callback, &my_sci_handle);
            if (SCI_SUCCESS != my_sci_err)
            {
                nop();
                secure_boot_state      = BOOT_LOADER_STATE_FATAL_ERROR;
                secure_boot_error_code = BOOT_LOADER_FAIL;
                break;
            }

            load_firmware_control_block.progress = 0;
            load_firmware_control_block.offset   = 0;

            flash_api_error_code = R_FLASH_Open();
            if (FLASH_SUCCESS != flash_api_error_code)
            {
                printf("R_FLASH_Open() returns error. %d.\r\n", flash_error_code);
                printf("system error.\r\n");
                secure_boot_state      = BOOT_LOADER_STATE_FATAL_ERROR;
                secure_boot_error_code = BOOT_LOADER_FAIL;
            }

            printf("-------------------------------------------------\r\n");
            printf("RX secure boot program\r\n");
            printf("-------------------------------------------------\r\n");

#if RX_BOOTLOADER_USE_DATAFLASH_KEY_STORE
            printf("Checking data flash ROM status.\r\n");
            R_SFD_Open();

            printf("Loading user code signer public key: ");
            sfd_handle = R_SFD_FindObject((uint8_t *)code_signer_public_key_label,
                                          sizeof(code_signer_public_key_label));
            if (sfd_handle != SFD_HANDLE_INVALID)
            {
                printf("found.\r\n");
                R_SFD_GetObjectValue(sfd_handle,
                                     (uint8_t **)&local_code_signer_public_key,
                                     &local_code_signer_public_key_size);
            }
            else
            {
                printf("not found.\r\n");
                printf("provision the user code signer public key: ");
                R_SFD_Open();
                sfd_handle = R_SFD_SaveObject((uint8_t *)code_signer_public_key_label,
                                              sizeof(code_signer_public_key_label),
                                              (uint8_t *)code_signer_public_key,
                                              code_signer_public_key_length);
                if (sfd_handle != SFD_HANDLE_INVALID)
                {
                    printf("OK.\r\n");
                    R_SFD_GetObjectValue(sfd_handle,
                                         (uint8_t **)&local_code_signer_public_key,
                                         &local_code_signer_public_key_size);
                }
                else
                {
                    printf("NG.\r\n");
                }
                R_SFD_Close();
            }
            R_SFD_Close();
#endif /* RX_BOOTLOADER_USE_DATAFLASH_KEY_STORE */

            printf("Checking code flash ROM status.\r\n");
            printf("bank 0 status = 0x%x [%s]\r\n", firmware_update_control_block_bank0->image_flag, get_status_string(firmware_update_control_block_bank0->image_flag));
            printf("bank 1 status = 0x%x [%s]\r\n", firmware_update_control_block_bank1->image_flag, get_status_string(firmware_update_control_block_bank1->image_flag));

            R_FLASH_Control(FLASH_CMD_BANK_GET, &bank_info);
            printf("bank info = %d. (start bank = %d)\r\n", bank_info, (bank_info ^ 0x01));

            cb_func_info.pcallback    = my_flash_callback;
            cb_func_info.int_priority = RX_BOOTLOADER_FLASH_INT_PRIORITY;
            R_FLASH_Control(FLASH_CMD_SET_BGO_CALLBACK, (void *)&cb_func_info);

#if RX_BOOTLOADER_USE_PERF_COUNTER
            R_CMT_CreatePeriodic(100000, bootloader_software_timer_handler, &my_cmt_channel);
            printf("started 10us software timer using CMT channel %d.\r\n", my_cmt_channel);
#endif

            secure_boot_state = BOOT_LOADER_STATE_BANK1_CHECK;
            break;

        case BOOT_LOADER_STATE_BANK1_CHECK:
            if (firmware_update_control_block_bank1->image_flag == LIFECYCLE_STATE_TESTING)
            {
                memcpy(load_firmware_control_block.flash_buffer,
                       (void *)RX_BOOTLOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS,
                       FLASH_CF_MEDIUM_BLOCK_SIZE);

                printf("integrity check scheme = %-.32s\r\n", firmware_update_control_block_bank1->signature_type);
                printf("bank1(temporary area) on code flash integrity check...");

                if (!strcmp((const char *)firmware_update_control_block_bank1->signature_type,
                            INTEGRITY_CHECK_SCHEME_HASH_SHA256_STANDALONE))
                {
                    uint8_t hash_sha256[TC_SHA256_DIGEST_SIZE];
                    struct tc_sha256_state_struct xCtx;
                    tc_sha256_init(&xCtx);
                    tc_sha256_update(&xCtx,
                        (uint8_t *)RX_BOOTLOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS + RX_BOOTLOADER_FW_HEADER_LENGTH,
                        (FLASH_CF_MEDIUM_BLOCK_SIZE * RX_BOOTLOADER_UPDATE_TARGET_BLOCK_NUMBER) - RX_BOOTLOADER_FW_HEADER_LENGTH);
                    tc_sha256_final(hash_sha256, &xCtx);
                    verification_result = memcmp(firmware_update_control_block_bank1->signature, hash_sha256, sizeof(hash_sha256));
                }
                else if (!strcmp((const char *)firmware_update_control_block_bank1->signature_type,
                                 INTEGRITY_CHECK_SCHEME_SIG_SHA256_ECDSA_STANDALONE))
                {
                    verification_result = firmware_verification_sha256_ecdsa(
                        (const uint8_t *)RX_BOOTLOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS + RX_BOOTLOADER_FW_HEADER_LENGTH,
                        (FLASH_CF_MEDIUM_BLOCK_SIZE * RX_BOOTLOADER_UPDATE_TARGET_BLOCK_NUMBER) - RX_BOOTLOADER_FW_HEADER_LENGTH,
                        firmware_update_control_block_bank1->signature,
                        firmware_update_control_block_bank1->signature_size,
                        local_code_signer_public_key);
                }
                else
                {
                    verification_result = -1;
                }

