HirokiIshiguro/iot-reference-rx/Projects/boot_loader_ck_rx65n/e2studio_ccrx/lib/rx_bootloader/rx_bootloader.c
                if (0 == verification_result)
                {
                    printf("OK\r\n");
                    firmware_update_control_block_tmp->image_flag = LIFECYCLE_STATE_VALID;
                }
                else
                {
                    printf("NG\r\n");
                    firmware_update_control_block_tmp->image_flag = LIFECYCLE_STATE_INVALID;
                }
                printf("update LIFECYCLE_STATE from [%s] to [%s]\r\n",
                       get_status_string(firmware_update_control_block_bank1->image_flag),
                       get_status_string(firmware_update_control_block_tmp->image_flag));
                printf("bank1(temporary area) block0 erase (to update LIFECYCLE_STATE)...");
                flash_api_error_code = R_FLASH_Erase((flash_block_address_t)RX_BOOTLOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS, 1);
                if (FLASH_SUCCESS != flash_api_error_code)
                {
                    printf("R_FLASH_Erase() returns error. %d.\r\n", flash_error_code);
                    printf("system error.\r\n");
                    secure_boot_state      = BOOT_LOADER_STATE_FATAL_ERROR;
                    secure_boot_error_code = BOOT_LOADER_FAIL;
                    break;
                }
                secure_boot_state = BOOT_LOADER_STATE_BANK1_UPDATE_LIFECYCLE_ERASE_WAIT;
            }
            else
            {
                if (firmware_update_control_block_bank0->image_flag == LIFECYCLE_STATE_VALID)
                {
                    secure_boot_state = BOOT_LOADER_STATE_BANK0_UPDATE_CHECK;
                }
                else
                {
                    secure_boot_state = BOOT_LOADER_STATE_BANK0_CHECK;
                }
            }
            break;

        case BOOT_LOADER_STATE_BANK1_UPDATE_LIFECYCLE_ERASE_WAIT:
            /* this state will be updated by flash callback */
            break;

        case BOOT_LOADER_STATE_BANK1_UPDATE_LIFECYCLE_ERASE_COMPLETE:
            if (FLASH_SUCCESS == flash_error_code)
            {
                printf("OK\r\n");
            }
            else
            {
                printf("R_FLASH_Erase() callback error. %d.\r\n", flash_error_code);
                printf("system error.\r\n");
                secure_boot_state = BOOT_LOADER_STATE_FATAL_ERROR;
                break;
            }
            printf("bank1(temporary area) block0 write (to update LIFECYCLE_STATE)...");
            flash_api_error_code = R_FLASH_Write((uint32_t)firmware_update_control_block_tmp,
                                                 (uint32_t)RX_BOOTLOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS,
                                                 FLASH_CF_MEDIUM_BLOCK_SIZE);
            if (FLASH_SUCCESS != flash_api_error_code)
            {
                printf("R_FLASH_Write() returns error. %d.\r\n", flash_error_code);
                printf("system error.\r\n");
                secure_boot_state      = BOOT_LOADER_STATE_FATAL_ERROR;
                secure_boot_error_code = BOOT_LOADER_FAIL;
                break;
            }
            secure_boot_state = BOOT_LOADER_STATE_BANK1_UPDATE_LIFECYCLE_WRITE_WAIT;
            break;

        case BOOT_LOADER_STATE_BANK1_UPDATE_LIFECYCLE_WRITE_WAIT:
            /* this state will be updated by flash callback */
            break;

        case BOOT_LOADER_STATE_BANK1_UPDATE_LIFECYCLE_WRITE_COMPLETE:
            if (FLASH_SUCCESS == flash_error_code)
            {
                printf("OK\r\n");
            }
            else
            {
                printf("R_FLASH_Write() callback error. %d.\r\n", flash_error_code);
                printf("system error.\r\n");
                secure_boot_state      = BOOT_LOADER_STATE_FATAL_ERROR;
                secure_boot_error_code = BOOT_LOADER_FAIL;
                break;
            }
            printf("refresh bank1 secure boot mirror area before swap...");
            flash_api_error_code = R_FLASH_Erase(RX_BOOTLOADER_MIRROR_HIGH_ADDRESS,
                                                 RX_BOOTLOADER_MIRROR_BLOCK_NUM_FOR_SMALL + RX_BOOTLOADER_MIRROR_BLOCK_NUM_FOR_MEDIUM);
            if (FLASH_SUCCESS != flash_api_error_code)
            {
                printf("NG\r\n");
                printf("R_FLASH_Erase() returns error code = %d.\r\n", flash_error_code);
                secure_boot_state      = BOOT_LOADER_STATE_FATAL_ERROR;
                secure_boot_error_code = BOOT_LOADER_FAIL;
                break;
            }
            secure_boot_state = BOOT_LOADER_STATE_BANK1_REFRESH_SECURE_BOOT_ERASE_WAIT;
            break;

        case BOOT_LOADER_STATE_BANK1_REFRESH_SECURE_BOOT_ERASE_WAIT:
            /* this state will be updated by flash callback */
            break;

        case BOOT_LOADER_STATE_BANK1_REFRESH_SECURE_BOOT_ERASE_COMPLETE:
            if (FLASH_SUCCESS == flash_error_code)
            {
                printf("OK\r\n");
            }
            else
            {
                printf("R_FLASH_Erase() callback error. %d.\r\n", flash_error_code);
                printf("system error.\r\n");
                secure_boot_state      = BOOT_LOADER_STATE_FATAL_ERROR;
                secure_boot_error_code = BOOT_LOADER_FAIL;
                break;
            }
            printf("copy secure boot (part1) from bank0 to bank1...");
            flash_api_error_code = R_FLASH_Write((uint32_t)RX_BOOTLOADER_LOW_ADDRESS,
                                                 (uint32_t)RX_BOOTLOADER_MIRROR_LOW_ADDRESS,
                                                 ((uint32_t)RX_BOOTLOADER_MIRROR_BLOCK_NUM_FOR_MEDIUM) * FLASH_CF_MEDIUM_BLOCK_SIZE);
            if (FLASH_SUCCESS != flash_api_error_code)
            {
                printf("NG\r\n");
                printf("R_FLASH_Write() returns error code = %d.\r\n", flash_error_code);
                secure_boot_state      = BOOT_LOADER_STATE_FATAL_ERROR;
                secure_boot_error_code = BOOT_LOADER_FAIL;
                break;
            }
            secure_boot_state = BOOT_LOADER_STATE_BANK1_REFRESH_SECURE_BOOT_WRITE_WAIT1;
            break;

        case BOOT_LOADER_STATE_BANK1_REFRESH_SECURE_BOOT_WRITE_WAIT1:
            /* this state will be updated by flash callback */
            break;

        case BOOT_LOADER_STATE_BANK1_REFRESH_SECURE_BOOT_WRITE_COMPLETE1:
            if (FLASH_SUCCESS == flash_error_code)
            {
                printf("OK\r\n");
            }
            else
            {
                printf("R_FLASH_Write() callback error. %d.\r\n", flash_error_code);
                printf("system error.\r\n");
                secure_boot_state      = BOOT_LOADER_STATE_FATAL_ERROR;
                secure_boot_error_code = BOOT_LOADER_FAIL;
                break;
            }
            printf("copy secure boot (part2) from bank0 to bank1...");
            if (RX_BOOTLOADER_MIRROR_BLOCK_NUM_FOR_MEDIUM > 0)
            {
                flash_api_error_code = R_FLASH_Write((uint32_t)RX_BOOTLOADER_SMALL_BLOCK_SRC,
                                                     (uint32_t)RX_BOOTLOADER_SMALL_BLOCK_DST,
                                                     RX_BOOTLOADER_MIRROR_BLOCK_NUM_FOR_SMALL * FLASH_CF_SMALL_BLOCK_SIZE);
                if (FLASH_SUCCESS != flash_api_error_code)
                {
                    printf("NG\r\n");
                    printf("R_FLASH_Write() returns error code = %d.\r\n", flash_error_code);
                    secure_boot_state      = BOOT_LOADER_STATE_FATAL_ERROR;
                    secure_boot_error_code = BOOT_LOADER_FAIL;
                    break;
                }
                secure_boot_state = BOOT_LOADER_STATE_BANK1_REFRESH_SECURE_BOOT_WRITE_WAIT2;
            }
            else
            {
                secure_boot_state = BOOT_LOADER_STATE_BANK1_REFRESH_SECURE_BOOT_WRITE_COMPLETE2;
            }
            break;

        case BOOT_LOADER_STATE_BANK1_REFRESH_SECURE_BOOT_WRITE_WAIT2:
            /* this state will be updated by flash callback */
            break;

        case BOOT_LOADER_STATE_BANK1_REFRESH_SECURE_BOOT_WRITE_COMPLETE2:
            if (FLASH_SUCCESS == flash_error_code)
            {
                printf("OK\r\n");
            }
            else
            {
                printf("R_FLASH_Write() callback error. %d.\r\n", flash_error_code);
                printf("system error.\r\n");
                secure_boot_state      = BOOT_LOADER_STATE_FATAL_ERROR;
                secure_boot_error_code = BOOT_LOADER_FAIL;
                break;
            }
            printf("swap bank...\r\n");
            R_BSP_SoftwareDelay(3000, BSP_DELAY_MILLISECS);
            bank_swap_with_software_reset();
            while (1);
            break;

        case BOOT_LOADER_STATE_BANK0_CHECK:
        case BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_WAIT:
        case BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_COMPLETE:
        case BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_WAIT1:
        case BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_COMPLETE1:
        case BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_WAIT2:
        case BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_COMPLETE2:
        case BOOT_LOADER_STATE_INSTALL_DATA_FLASH_ERASE_WAIT:
        case BOOT_LOADER_STATE_INSTALL_DATA_FLASH_ERASE_COMPLETE:
        case BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_ERASE_WAIT:
        case BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_ERASE_COMPLETE:
        case BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_READ_WAIT:
        case BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_READ_COMPLETE:
        case BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_WRITE_WAIT:
        case BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_WRITE_COMPLETE:
        case BOOT_LOADER_STATE_INSTALL_DATA_FLASH_READ_WAIT:
        case BOOT_LOADER_STATE_INSTALL_DATA_FLASH_READ_COMPLETE:
        case BOOT_LOADER_STATE_INSTALL_DATA_FLASH_WRITE_WAIT:
        case BOOT_LOADER_STATE_INSTALL_DATA_FLASH_WRITE_COMPLETE:
        case BOOT_LOADER_STATE_BANK0_UPDATE_CHECK:
        case BOOT_LOADER_STATE_BANK1_UPDATE_CODE_FLASH_ERASE_WAIT:
        case BOOT_LOADER_STATE_BANK1_UPDATE_CODE_FLASH_ERASE_COMPLETE:
        case BOOT_LOADER_STATE_FINALIZE:
            switch (firmware_update_control_block_bank0->image_flag)
            {
                case LIFECYCLE_STATE_BLANK:
                    switch (secure_boot_state)
                    {
                        case BOOT_LOADER_STATE_BANK0_CHECK:
                            if (firmware_update_control_block_bank1->image_flag == LIFECYCLE_STATE_VALID)
                            {
                                printf("bank0 is blank and bank1 is valid. swap bank...\r\n");
                                R_BSP_SoftwareDelay(3000, BSP_DELAY_MILLISECS);
                                bank_swap_with_software_reset();
                                while (1);
                            }
                            printf("start installing user program.\r\n");
                            if (firmware_update_control_block_bank1->image_flag == LIFECYCLE_STATE_INSTALLING)
                            {
                                secure_boot_state = BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_COMPLETE;
                            }
                            else
                            {
                                printf("erase bank1 secure boot mirror area...");
                                flash_api_error_code = R_FLASH_Erase(RX_BOOTLOADER_MIRROR_HIGH_ADDRESS,
                                                                     RX_BOOTLOADER_MIRROR_BLOCK_NUM_FOR_SMALL + RX_BOOTLOADER_MIRROR_BLOCK_NUM_FOR_MEDIUM);
                                if (FLASH_SUCCESS != flash_api_error_code)
                                {
                                    printf("NG\r\n");
                                    printf("R_FLASH_Erase() returns error code = %d.\r\n", flash_error_code);
                                    secure_boot_state      = BOOT_LOADER_STATE_FATAL_ERROR;
                                    secure_boot_error_code = BOOT_LOADER_FAIL;
                                    break;
                                }
                                secure_boot_state = BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_WAIT;
                            }
                            break;

                        case BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_WAIT:
                            /* this state will be updated by flash callback */
                            break;

                        case BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_COMPLETE:
                            if (firmware_update_control_block_bank1->image_flag != LIFECYCLE_STATE_INSTALLING)
                            {
                                if (FLASH_SUCCESS == flash_error_code)
                                {
                                    printf("OK\r\n");
                                }
                                else
                                {
                                    printf("R_FLASH_Erase() callback error. %d.\r\n", flash_error_code);
                                    printf("system error.\r\n");
                                    secure_boot_state      = BOOT_LOADER_STATE_FATAL_ERROR;
                                    secure_boot_error_code = BOOT_LOADER_FAIL;
                                    break;
                                }
                            }
                            printf("copy secure boot (part1) from bank0 to bank1...");
                            flash_api_error_code = R_FLASH_Write((uint32_t)RX_BOOTLOADER_LOW_ADDRESS,
                                                                 (uint32_t)RX_BOOTLOADER_MIRROR_LOW_ADDRESS,
                                                                 ((uint32_t)RX_BOOTLOADER_MIRROR_BLOCK_NUM_FOR_MEDIUM) * FLASH_CF_MEDIUM_BLOCK_SIZE);
                            if (FLASH_SUCCESS != flash_api_error_code)
                            {
                                printf("NG\r\n");
                                printf("R_FLASH_Write() returns error code = %d.\r\n", flash_error_code);
                                secure_boot_state      = BOOT_LOADER_STATE_FATAL_ERROR;
                                secure_boot_error_code = BOOT_LOADER_FAIL;
                                break;
                            }
                            secure_boot_state = BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_WAIT1;
                            break;

                        case BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_WAIT1:
                            /* this state will be updated by flash callback */
                            break;

                        case BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_COMPLETE1:
                            if (FLASH_SUCCESS == flash_error_code)
                            {
                                printf("OK\r\n");
                            }
                            else
                            {
                                printf("R_FLASH_Write() callback error. %d.\r\n", flash_error_code);
                                printf("system error.\r\n");
                                secure_boot_state      = BOOT_LOADER_STATE_FATAL_ERROR;
                                secure_boot_error_code = BOOT_LOADER_FAIL;
                                break;
                            }
                            printf("copy secure boot (part2) from bank0 to bank1...");
                            if (RX_BOOTLOADER_MIRROR_BLOCK_NUM_FOR_MEDIUM > 0)
                            {
                                flash_api_error_code = R_FLASH_Write((uint32_t)RX_BOOTLOADER_SMALL_BLOCK_SRC,
                                                                     (uint32_t)RX_BOOTLOADER_SMALL_BLOCK_DST,
                                                                     RX_BOOTLOADER_MIRROR_BLOCK_NUM_FOR_SMALL * FLASH_CF_SMALL_BLOCK_SIZE);
                                if (FLASH_SUCCESS != flash_api_error_code)
                                {
                                    printf("NG\r\n");
                                    printf("R_FLASH_Write() returns error code = %d.\r\n", flash_error_code);
                                    secure_boot_error_code = BOOT_LOADER_FAIL;
                                    break;
                                }
                            }
                            else
                            {
                                secure_boot_state = BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_COMPLETE2;
                            }
                            secure_boot_state = BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_WAIT2;
                            break;

                        case BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_WAIT2:
                            /* this state will be updated by flash callback */
                            break;

                        case BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_COMPLETE2:
                            if (FLASH_SUCCESS == flash_error_code)
                            {
                                printf("OK\r\n");
                            }
                            else
                            {
                                printf("R_FLASH_Write() callback error. %d.\r\n", flash_error_code);
                                printf("system error.\r\n");
                                secure_boot_state      = BOOT_LOADER_STATE_FATAL_ERROR;
                                secure_boot_error_code = BOOT_LOADER_FAIL;
                                break;
                            }
                            if (firmware_update_control_block_bank1->image_flag == LIFECYCLE_STATE_INSTALLING)
                            {
                                memcpy(load_firmware_control_block.flash_buffer,
                                       (void *)RX_BOOTLOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS,
                                       FLASH_CF_MEDIUM_BLOCK_SIZE);
                                firmware_update_control_block_tmp->image_flag = LIFECYCLE_STATE_VALID;
                                printf("update LIFECYCLE_STATE from [%s] to [%s]\r\n",
                                       get_status_string(firmware_update_control_block_bank1->image_flag),
                                       get_status_string(firmware_update_control_block_tmp->image_flag));
                                printf("bank1(temporary area) block0 erase (to update LIFECYCLE_STATE)...");
                                flash_api_error_code = R_FLASH_Erase((flash_block_address_t)RX_BOOTLOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS, 1);
                                if (FLASH_SUCCESS != flash_api_error_code)
                                {
                                    printf("R_FLASH_Erase() returns error. %d.\r\n", flash_error_code);
                                    printf("system error.\r\n");
                                    secure_boot_state      = BOOT_LOADER_STATE_FATAL_ERROR;
                                    secure_boot_error_code = BOOT_LOADER_FAIL;
                                    break;
                                }
                                secure_boot_state = BOOT_LOADER_STATE_BANK1_UPDATE_LIFECYCLE_ERASE_WAIT;
                            }
                            else
                            {
                                printf("========== install user program phase ==========\r\n");
                                printf("erase install area (data flash): ");
                                flash_api_error_code = R_FLASH_Erase((flash_block_address_t)RX_BOOTLOADER_USER_CONST_DATA_LOW_ADDRESS,
                                                                     RX_BOOTLOADER_UPDATE_CONST_DATA_TARGET_BLOCK_NUMBER);
                                if (FLASH_SUCCESS != flash_api_error_code)
                                {
                                    printf("R_FLASH_Erase() returns error. %d.\r\n", flash_error_code);
                                    printf("system error.\r\n");
                                    secure_boot_error_code = BOOT_LOADER_FAIL;
                                    break;
                                }
                                secure_boot_state = BOOT_LOADER_STATE_INSTALL_DATA_FLASH_ERASE_WAIT;
                            }
                            break;

                        case BOOT_LOADER_STATE_INSTALL_DATA_FLASH_ERASE_WAIT:
                            /* this state will be updated by flash callback */
                            break;

                        case BOOT_LOADER_STATE_INSTALL_DATA_FLASH_ERASE_COMPLETE:
                            if (FLASH_SUCCESS == flash_error_code)
                            {
                                printf("OK\r\n");
                            }
                            else
                            {
                                printf("R_FLASH_Write() callback error. %d.\r\n", flash_error_code);
                                printf("system error.\r\n");
                                secure_boot_state      = BOOT_LOADER_STATE_FATAL_ERROR;
                                secure_boot_error_code = BOOT_LOADER_FAIL;
                                break;
                            }
                            printf("erase install area (code flash): ");
                            flash_api_error_code = R_FLASH_Erase((flash_block_address_t)RX_BOOTLOADER_UPDATE_TEMPORARY_AREA_HIGH_ADDRESS,
                                                                 FLASH_NUM_BLOCKS_CF - RX_BOOTLOADER_MIRROR_BLOCK_NUM_FOR_SMALL - RX_BOOTLOADER_MIRROR_BLOCK_NUM_FOR_MEDIUM);
                            if (FLASH_SUCCESS != flash_api_error_code)
                            {
                                printf("R_FLASH_Erase() returns error. %d.\r\n", flash_error_code);
                                printf("system error.\r\n");
                                secure_boot_error_code = BOOT_LOADER_FAIL;
                                break;
                            }
                            secure_boot_state = BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_ERASE_WAIT;
                            break;

                        case BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_ERASE_WAIT:
                            /* this state will be updated by flash callback */
                            break;

