HirokiIshiguro/iot-reference-rx/Projects/boot_loader_ck_rx65n/e2studio_ccrx/lib/rx_bootloader/rx_bootloader.c
                        case BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_ERASE_COMPLETE:
                            if (FLASH_SUCCESS == flash_error_code)
                            {
                                printf("OK\r\n");
                            }
                            else
                            {
                                printf("R_FLASH_Write() callback error. %d.\r\n", flash_error_code);
                                printf("system error.\r\n");
                                secure_boot_state      = BOOT_LOADER_STATE_FATAL_ERROR;
                                secure_boot_error_code = BOOT_LOADER_FAIL;
                                break;
                            }
                            sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_A].buffer_full_flag = BOOT_LOADER_SCI_RECEIVE_BUFFER_EMPTY;
                            sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_B].buffer_full_flag = BOOT_LOADER_SCI_RECEIVE_BUFFER_EMPTY;
                            sci_receive_control_block.p_sci_buffer_control = &sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_A];
                            sci_receive_control_block.current_state        = BOOT_LOADER_SCI_CONTROL_BLOCK_A;
                            printf("send \"%s\" via UART.\r\n", RX_BOOTLOADER_INITIAL_FW_FILENAME);
                            secure_boot_state = BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_READ_WAIT;
                            break;

                        case BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_READ_WAIT:
                            if (!firm_block_read(load_firmware_control_block.flash_buffer, load_firmware_control_block.offset))
                            {
                                flash_api_error_code = R_FLASH_Write((uint32_t)load_firmware_control_block.flash_buffer,
                                                                     (uint32_t)RX_BOOTLOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS + load_firmware_control_block.offset,
                                                                     sizeof(load_firmware_control_block.flash_buffer));
                                if (FLASH_SUCCESS != flash_api_error_code)
                                {
                                    printf("R_FLASH_Write() returns error. %d.\r\n", flash_error_code);
                                    printf("system error.\r\n");
                                    secure_boot_error_code = BOOT_LOADER_FAIL;
                                    break;
                                }
                                secure_boot_state = BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_WRITE_WAIT;
                            }
                            break;

                        case BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_WRITE_WAIT:
                            /* this state will be updated by flash callback */
                            break;

                        case BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_WRITE_COMPLETE:
                            if (FLASH_SUCCESS != flash_error_code)
                            {
                                printf("R_FLASH_Write() callback error. %d.\r\n", flash_error_code);
                                printf("system error.\r\n");
                                secure_boot_state      = BOOT_LOADER_STATE_FATAL_ERROR;
                                secure_boot_error_code = BOOT_LOADER_FAIL;
                                break;
                            }

                            load_firmware_control_block.offset += FLASH_CF_MEDIUM_BLOCK_SIZE;
                            load_firmware_control_block.progress =
                                (uint32_t)(((float)(load_firmware_control_block.offset) /
                                            (float)((FLASH_CF_MEDIUM_BLOCK_SIZE * RX_BOOTLOADER_UPDATE_TARGET_BLOCK_NUMBER)) * 100));
                            printf("installing firmware...%d%%(%d/%dKB).\r",
                                   load_firmware_control_block.progress,
                                   load_firmware_control_block.offset / 1024,
                                   (FLASH_CF_MEDIUM_BLOCK_SIZE * RX_BOOTLOADER_UPDATE_TARGET_BLOCK_NUMBER) / 1024);
                            if (load_firmware_control_block.offset < (FLASH_CF_MEDIUM_BLOCK_SIZE * RX_BOOTLOADER_UPDATE_TARGET_BLOCK_NUMBER))
                            {
                                secure_boot_state = BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_READ_WAIT;
                            }
                            else if (load_firmware_control_block.offset == (FLASH_CF_MEDIUM_BLOCK_SIZE * RX_BOOTLOADER_UPDATE_TARGET_BLOCK_NUMBER))
                            {
                                printf("\n");
                                printf("completed installing firmware.\r\n");
                                printf("integrity check scheme = %-.32s\r\n", firmware_update_control_block_bank1->signature_type);
                                printf("bank1(temporary area) on code flash integrity check...");

                                if (!strcmp((const char *)firmware_update_control_block_bank1->signature_type,
                                            INTEGRITY_CHECK_SCHEME_HASH_SHA256_STANDALONE))
                                {
                                    uint8_t hash_sha256[TC_SHA256_DIGEST_SIZE];
                                    struct tc_sha256_state_struct xCtx;
                                    tc_sha256_init(&xCtx);
                                    tc_sha256_update(&xCtx,
                                        (uint8_t *)RX_BOOTLOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS + RX_BOOTLOADER_FW_HEADER_LENGTH,
                                        (FLASH_CF_MEDIUM_BLOCK_SIZE * RX_BOOTLOADER_UPDATE_TARGET_BLOCK_NUMBER) - RX_BOOTLOADER_FW_HEADER_LENGTH);
                                    tc_sha256_final(hash_sha256, &xCtx);
                                    verification_result = memcmp(firmware_update_control_block_bank1->signature, hash_sha256, sizeof(hash_sha256));
                                }
                                else if (!strcmp((const char *)firmware_update_control_block_bank1->signature_type,
                                                 INTEGRITY_CHECK_SCHEME_SIG_SHA256_ECDSA_STANDALONE))
                                {
                                    verification_result = firmware_verification_sha256_ecdsa(
                                        (const uint8_t *)RX_BOOTLOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS + RX_BOOTLOADER_FW_HEADER_LENGTH,
                                        (FLASH_CF_MEDIUM_BLOCK_SIZE * RX_BOOTLOADER_UPDATE_TARGET_BLOCK_NUMBER) - RX_BOOTLOADER_FW_HEADER_LENGTH,
                                        firmware_update_control_block_bank1->signature,
                                        firmware_update_control_block_bank1->signature_size,
                                        local_code_signer_public_key);
                                }
                                else
                                {
                                    verification_result = -1;
                                }

