HirokiIshiguro/iot-reference-rx/Projects/boot_loader_ck_rx65n/e2studio_ccrx/lib/rx_bootloader/rx_bootloader.c
                                if (0 == verification_result)
                                {
                                    printf("OK\r\n");
                                    load_const_data_control_block.offset = 0;
                                    secure_boot_state = BOOT_LOADER_STATE_INSTALL_DATA_FLASH_READ_WAIT;
                                }
                                else
                                {
                                    printf("NG\r\n");
                                    secure_boot_state      = BOOT_LOADER_STATE_FATAL_ERROR;
                                    secure_boot_error_code = BOOT_LOADER_FAIL;
                                }
                            }
                            else
                            {
                                printf("\n");
                                printf("fatal error occurred.\r\n");
                                secure_boot_state      = BOOT_LOADER_STATE_FATAL_ERROR;
                                secure_boot_error_code = BOOT_LOADER_FAIL;
                            }
                            break;

                        case BOOT_LOADER_STATE_INSTALL_DATA_FLASH_READ_WAIT:
                            if (!const_data_block_read(load_const_data_control_block.flash_buffer, load_const_data_control_block.offset))
                            {
                                secure_boot_state = BOOT_LOADER_STATE_INSTALL_DATA_FLASH_READ_COMPLETE;
                            }
                            break;

                        case BOOT_LOADER_STATE_INSTALL_DATA_FLASH_READ_COMPLETE:
                            flash_api_error_code = R_FLASH_Write(
                                (uint32_t)&load_const_data_control_block.flash_buffer[load_const_data_control_block.offset / 4],
                                (uint32_t)RX_BOOTLOADER_USER_CONST_DATA_LOW_ADDRESS + load_const_data_control_block.offset,
                                FLASH_DF_BLOCK_SIZE);
                            if (FLASH_SUCCESS != flash_api_error_code)
                            {
                                printf("R_FLASH_Write() returns error. %d.\r\n", flash_error_code);
                                printf("system error.\r\n");
                                secure_boot_error_code = BOOT_LOADER_FAIL;
                                break;
                            }
                            secure_boot_state = BOOT_LOADER_STATE_INSTALL_DATA_FLASH_WRITE_WAIT;
                            break;

                        case BOOT_LOADER_STATE_INSTALL_DATA_FLASH_WRITE_WAIT:
                            /* this state will be updated by flash callback */
                            break;

                        case BOOT_LOADER_STATE_INSTALL_DATA_FLASH_WRITE_COMPLETE:
                            if (FLASH_SUCCESS != flash_error_code)
                            {
                                printf("R_FLASH_Write() callback error. %d.\r\n", flash_error_code);
                                printf("system error.\r\n");
                                secure_boot_state      = BOOT_LOADER_STATE_FATAL_ERROR;
                                secure_boot_error_code = BOOT_LOADER_FAIL;
                                break;
                            }

                            load_const_data_control_block.offset += FLASH_DF_BLOCK_SIZE;
                            load_const_data_control_block.progress =
                                (uint32_t)(((float)(load_const_data_control_block.offset) /
                                            (float)((FLASH_DF_BLOCK_SIZE * RX_BOOTLOADER_UPDATE_CONST_DATA_TARGET_BLOCK_NUMBER)) * 100));
                            {
                                static uint32_t previous_offset = 0;
                                if (previous_offset != (load_const_data_control_block.offset / 1024))
                                {
                                    printf("installing const data...%d%%(%d/%dKB).\r",
                                           load_const_data_control_block.progress,
                                           load_const_data_control_block.offset / 1024,
                                           (FLASH_DF_BLOCK_SIZE * RX_BOOTLOADER_UPDATE_CONST_DATA_TARGET_BLOCK_NUMBER) / 1024);
                                    previous_offset = load_const_data_control_block.offset / 1024;
                                }
                            }
                            if (load_const_data_control_block.offset < (FLASH_DF_BLOCK_SIZE * RX_BOOTLOADER_UPDATE_CONST_DATA_TARGET_BLOCK_NUMBER))
                            {
                                secure_boot_state = BOOT_LOADER_STATE_INSTALL_DATA_FLASH_READ_COMPLETE;
                            }
                            else if (load_const_data_control_block.offset == (FLASH_DF_BLOCK_SIZE * RX_BOOTLOADER_UPDATE_CONST_DATA_TARGET_BLOCK_NUMBER))
                            {
                                printf("\n");
                                printf("completed installing const data.\r\n");
                                printf("software reset...\r\n");
                                R_BSP_SoftwareDelay(3000, BSP_DELAY_MILLISECS);
                                software_reset();
                            }
                            else
                            {
                                printf("\n");
                                printf("fatal error occurred.\r\n");
                                secure_boot_state      = BOOT_LOADER_STATE_FATAL_ERROR;
                                secure_boot_error_code = BOOT_LOADER_FAIL;
                            }
                            break;
                    }
                    break;

                case LIFECYCLE_STATE_TESTING:
                    printf("illegal status\r\n");
                    printf("swap bank...");
                    R_BSP_SoftwareDelay(3000, BSP_DELAY_MILLISECS);
                    bank_swap_with_software_reset();
                    while (1);
                    break;

                case LIFECYCLE_STATE_VALID:
                    switch (secure_boot_state)
                    {
                        case BOOT_LOADER_STATE_BANK0_UPDATE_CHECK:
                            printf("integrity check scheme = %-.32s\r\n", firmware_update_control_block_bank0->signature_type);
                            printf("bank0(execute area) on code flash integrity check...");
                            if (!strcmp((const char *)firmware_update_control_block_bank0->signature_type,
                                        INTEGRITY_CHECK_SCHEME_HASH_SHA256_STANDALONE))
                            {
                                uint8_t hash_sha256[TC_SHA256_DIGEST_SIZE];
                                struct tc_sha256_state_struct xCtx;
                                tc_sha256_init(&xCtx);
                                tc_sha256_update(&xCtx,
                                    (uint8_t *)RX_BOOTLOADER_UPDATE_EXECUTE_AREA_LOW_ADDRESS + RX_BOOTLOADER_FW_HEADER_LENGTH,
                                    (FLASH_CF_MEDIUM_BLOCK_SIZE * RX_BOOTLOADER_UPDATE_TARGET_BLOCK_NUMBER) - RX_BOOTLOADER_FW_HEADER_LENGTH);
                                tc_sha256_final(hash_sha256, &xCtx);
                                verification_result = memcmp(firmware_update_control_block_bank0->signature, hash_sha256, sizeof(hash_sha256));
                            }
                            else if (!strcmp((const char *)firmware_update_control_block_bank0->signature_type,
                                             INTEGRITY_CHECK_SCHEME_SIG_SHA256_ECDSA_STANDALONE))
                            {
                                verification_result = firmware_verification_sha256_ecdsa(
                                    (const uint8_t *)RX_BOOTLOADER_UPDATE_EXECUTE_AREA_LOW_ADDRESS + RX_BOOTLOADER_FW_HEADER_LENGTH,
                                    (FLASH_CF_MEDIUM_BLOCK_SIZE * RX_BOOTLOADER_UPDATE_TARGET_BLOCK_NUMBER) - RX_BOOTLOADER_FW_HEADER_LENGTH,
                                    firmware_update_control_block_bank0->signature,
                                    firmware_update_control_block_bank0->signature_size,
                                    local_code_signer_public_key);
                            }
                            else
                            {
                                verification_result = -1;
                            }

