HirokiIshiguro/iot-reference-rx/Projects/boot_loader_ck_rx65n/e2studio_ccrx/lib/rx_bootloader/rx_bootloader.c
                            if (0 == verification_result)
                            {
                                printf("OK\r\n");
                                if (firmware_update_control_block_bank1->image_flag != LIFECYCLE_STATE_BLANK)
                                {
                                    printf("erase install area (code flash): ");
                                    flash_api_error_code = R_FLASH_Erase((flash_block_address_t)RX_BOOTLOADER_UPDATE_TEMPORARY_AREA_HIGH_ADDRESS,
                                                                         FLASH_NUM_BLOCKS_CF - RX_BOOTLOADER_MIRROR_BLOCK_NUM_FOR_SMALL - RX_BOOTLOADER_MIRROR_BLOCK_NUM_FOR_MEDIUM);
                                    if (FLASH_SUCCESS != flash_api_error_code)
                                    {
                                        printf("R_FLASH_Erase() returns error. %d.\r\n", flash_error_code);
                                        printf("system error.\r\n");
                                        secure_boot_state      = BOOT_LOADER_STATE_FATAL_ERROR;
                                        secure_boot_error_code = BOOT_LOADER_FAIL;
                                        break;
                                    }
                                    secure_boot_state = BOOT_LOADER_STATE_BANK1_UPDATE_CODE_FLASH_ERASE_WAIT;
                                }
                                else
                                {
#if RX_BOOTLOADER_USE_PERF_COUNTER
                                    printf("integrity check(parts of SHA256 process) needs %d us.\r\n", sha256_time);
                                    printf("integrity check(parts of ECDSA process) needs %d us.\r\n", ecdsa_time);
#endif
                                    secure_boot_state = BOOT_LOADER_STATE_FINALIZE;
                                }
                            }
                            else
                            {
                                printf("NG.\r\n");
                                printf("Code flash is completely broken.\r\n");
                                printf("Please erase all code flash.\r\n");
                                printf("And, write secure boot using debugger.\r\n");
                                secure_boot_state      = BOOT_LOADER_STATE_FATAL_ERROR;
                                secure_boot_error_code = BOOT_LOADER_FAIL;
                            }
                            break;

                        case BOOT_LOADER_STATE_BANK1_UPDATE_CODE_FLASH_ERASE_WAIT:
                            /* this state will be updated by flash callback */
                            break;

                        case BOOT_LOADER_STATE_BANK1_UPDATE_CODE_FLASH_ERASE_COMPLETE:
                            if (FLASH_SUCCESS == flash_error_code)
                            {
                                printf("OK\r\n");
                                secure_boot_state = BOOT_LOADER_STATE_FINALIZE;
                            }
                            else
                            {
                                printf("R_FLASH_Erase() callback error. %d.\r\n", flash_error_code);
                                printf("system error.\r\n");
                                secure_boot_state = BOOT_LOADER_STATE_FATAL_ERROR;
                            }
                            break;

                        case BOOT_LOADER_STATE_FINALIZE:
                            printf("jump to user program\r\n");
                            R_BSP_SoftwareDelay(1000, BSP_DELAY_MILLISECS);
                            secure_boot_error_code = BOOT_LOADER_SUCCESS;
                            break;
                    }
                    break;

                default:
                    printf("illegal flash rom status code 0x%x.\r\n", firmware_update_control_block_bank0->image_flag);
                    printf("integrity check scheme = %-.32s\r\n", firmware_update_control_block_bank1->signature_type);
                    printf("bank1(temporary area) on code flash integrity check...");

                    if (!strcmp((const char *)firmware_update_control_block_bank1->signature_type,
                                INTEGRITY_CHECK_SCHEME_HASH_SHA256_STANDALONE))
                    {
                        uint8_t hash_sha256[TC_SHA256_DIGEST_SIZE];
                        struct tc_sha256_state_struct xCtx;
                        tc_sha256_init(&xCtx);
                        tc_sha256_update(&xCtx,
                            (uint8_t *)RX_BOOTLOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS + RX_BOOTLOADER_FW_HEADER_LENGTH,
                            (FLASH_CF_MEDIUM_BLOCK_SIZE * RX_BOOTLOADER_UPDATE_TARGET_BLOCK_NUMBER) - RX_BOOTLOADER_FW_HEADER_LENGTH);
                        tc_sha256_final(hash_sha256, &xCtx);
                        verification_result = memcmp(firmware_update_control_block_bank1->signature, hash_sha256, sizeof(hash_sha256));
                    }
                    else if (!strcmp((const char *)firmware_update_control_block_bank1->signature_type,
                                     INTEGRITY_CHECK_SCHEME_SIG_SHA256_ECDSA_STANDALONE))
                    {
                        verification_result = firmware_verification_sha256_ecdsa(
                            (const uint8_t *)RX_BOOTLOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS + RX_BOOTLOADER_FW_HEADER_LENGTH,
                            (FLASH_CF_MEDIUM_BLOCK_SIZE * RX_BOOTLOADER_UPDATE_TARGET_BLOCK_NUMBER) - RX_BOOTLOADER_FW_HEADER_LENGTH,
                            firmware_update_control_block_bank1->signature,
                            firmware_update_control_block_bank1->signature_size,
                            local_code_signer_public_key);
                    }
                    else
                    {
                        printf("This Firmware Verification Type is not implemented yet.\r\n");
                        verification_result = -1;
                    }

