HirokiIshiguro/iot-reference-rx/Projects/boot_loader_ck_rx65n/e2studio_ccrx/lib/rx_bootloader/rx_bootloader.c
                    if (0 == verification_result)
                    {
                        printf("OK\r\n");
                        R_BSP_SoftwareDelay(1000, BSP_DELAY_MILLISECS);
                        bank_swap_with_software_reset();
                    }
                    else
                    {
                        printf("NG\r\n");
                        R_BSP_SoftwareDelay(1000, BSP_DELAY_MILLISECS);
                        software_reset();
                    }
                    break;
            }
    }
    return secure_boot_error_code;
}

/***********************************************************************************************************************
* Function Name: software_reset
***********************************************************************************************************************/
__STATIC void software_reset(void)
{
    set_psw(0);
    R_BSP_InterruptsDisable();
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
    SYSTEM.SWRR = 0xa501;
    while (1);
}

/***********************************************************************************************************************
* Function Name: bank_swap_with_software_reset
***********************************************************************************************************************/
__STATIC void bank_swap_with_software_reset(void)
{
    set_psw(0);
    R_BSP_InterruptsDisable();
#if RX_BOOTLOADER_USE_DUAL_BANK
    R_FLASH_Control(FLASH_CMD_BANK_TOGGLE, NULL);
#endif
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
    SYSTEM.SWRR = 0xa501;
    while (1);
}

/***********************************************************************************************************************
* Function Name: firm_block_read
***********************************************************************************************************************/
__STATIC int32_t firm_block_read(uint32_t *firmware, uint32_t offset)
{
    int32_t error_code = -1;
    (void)offset;
    if (BOOT_LOADER_SCI_RECEIVE_BUFFER_FULL == sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_A].buffer_full_flag)
    {
        memcpy(firmware, sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_A].buffer, FLASH_CF_MEDIUM_BLOCK_SIZE);
        sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_A].buffer_full_flag = BOOT_LOADER_SCI_RECEIVE_BUFFER_EMPTY;
        error_code = 0;
    }
    else if (BOOT_LOADER_SCI_RECEIVE_BUFFER_FULL == sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_B].buffer_full_flag)
    {
        memcpy(firmware, sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_B].buffer, FLASH_CF_MEDIUM_BLOCK_SIZE);
        sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_B].buffer_full_flag = BOOT_LOADER_SCI_RECEIVE_BUFFER_EMPTY;
        error_code = 0;
    }
    return error_code;
}

/***********************************************************************************************************************
* Function Name: const_data_block_read
***********************************************************************************************************************/
__STATIC int32_t const_data_block_read(uint32_t *const_data, uint32_t offset)
{
    int32_t error_code = -1;
    (void)offset;
    if (BOOT_LOADER_SCI_RECEIVE_BUFFER_FULL == sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_A].buffer_full_flag)
    {
        memcpy(const_data, sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_A].buffer, RX_BOOTLOADER_CONST_DATA_TOTAL_SIZE);
        sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_A].buffer_occupied_byte_size = 0;
        sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_A].buffer_full_flag = BOOT_LOADER_SCI_RECEIVE_BUFFER_EMPTY;
        error_code = 0;
    }
    else if (sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_A].buffer_occupied_byte_size >= RX_BOOTLOADER_CONST_DATA_TOTAL_SIZE)
    {
        memcpy(const_data, sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_A].buffer, RX_BOOTLOADER_CONST_DATA_TOTAL_SIZE);
        sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_A].buffer_occupied_byte_size = 0;
        sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_A].buffer_full_flag = BOOT_LOADER_SCI_RECEIVE_BUFFER_EMPTY;
        error_code = 0;
    }
    else if (BOOT_LOADER_SCI_RECEIVE_BUFFER_FULL == sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_B].buffer_full_flag)
    {
        memcpy(const_data, sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_B].buffer, RX_BOOTLOADER_CONST_DATA_TOTAL_SIZE);
        sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_B].buffer_occupied_byte_size = 0;
        sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_B].buffer_full_flag = BOOT_LOADER_SCI_RECEIVE_BUFFER_EMPTY;
        error_code = 0;
    }
    else if (sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_B].buffer_occupied_byte_size >= RX_BOOTLOADER_CONST_DATA_TOTAL_SIZE)
    {
        memcpy(const_data, sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_B].buffer, RX_BOOTLOADER_CONST_DATA_TOTAL_SIZE);
        sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_B].buffer_occupied_byte_size = 0;
        sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_B].buffer_full_flag = BOOT_LOADER_SCI_RECEIVE_BUFFER_EMPTY;
        error_code = 0;
    }
    return error_code;
}

/***********************************************************************************************************************
* Function Name: sci_expected_receive_size
***********************************************************************************************************************/
__STATIC uint32_t sci_expected_receive_size(void)
{
    if ((BOOT_LOADER_STATE_INSTALL_DATA_FLASH_READ_WAIT == secure_boot_state) ||
        (BOOT_LOADER_STATE_INSTALL_DATA_FLASH_READ_COMPLETE == secure_boot_state) ||
        (BOOT_LOADER_STATE_INSTALL_DATA_FLASH_WRITE_WAIT == secure_boot_state) ||
        (BOOT_LOADER_STATE_INSTALL_DATA_FLASH_WRITE_COMPLETE == secure_boot_state))
    {
        return RX_BOOTLOADER_CONST_DATA_TOTAL_SIZE;
    }

    return FLASH_CF_MEDIUM_BLOCK_SIZE;
}

