HirokiIshiguro/iot-reference-rx/Projects/boot_loader_ck_rx65n/e2studio_ccrx/lib/rx_bootloader/rx_bootloader.c
/***********************************************************************************************************************
* Function Name: my_sci_callback
* Description  : SCI async mode RX callback. Fills double-buffered receive queue.
***********************************************************************************************************************/
uint32_t error_count1 = 0;
uint32_t error_count2 = 0;
uint32_t rcv_count1   = 0;
uint32_t rcv_count2   = 0;

__STATIC void my_sci_callback(void *pArgs)
{
    sci_cb_args_t *p_args = (sci_cb_args_t *)pArgs;
    uint32_t expected_receive_size = sci_expected_receive_size();

    if (SCI_EVT_RX_CHAR == p_args->event)
    {
        if (sci_receive_control_block.p_sci_buffer_control->buffer_occupied_byte_size <
            expected_receive_size)
        {
            R_SCI_Receive(p_args->hdl,
                &sci_receive_control_block.p_sci_buffer_control->buffer[sci_receive_control_block.p_sci_buffer_control->buffer_occupied_byte_size++],
                1);
            if (sci_receive_control_block.p_sci_buffer_control->buffer_occupied_byte_size ==
                expected_receive_size)
            {
                sci_receive_control_block.p_sci_buffer_control->buffer_occupied_byte_size = 0;
                sci_receive_control_block.p_sci_buffer_control->buffer_full_flag          = BOOT_LOADER_SCI_RECEIVE_BUFFER_FULL;
                sci_receive_control_block.total_byte_size += expected_receive_size;
                if (BOOT_LOADER_SCI_CONTROL_BLOCK_A == sci_receive_control_block.current_state)
                {
                    sci_receive_control_block.current_state        = BOOT_LOADER_SCI_CONTROL_BLOCK_B;
                    sci_receive_control_block.p_sci_buffer_control = &sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_B];
                }
                else
                {
                    sci_receive_control_block.current_state        = BOOT_LOADER_SCI_CONTROL_BLOCK_A;
                    sci_receive_control_block.p_sci_buffer_control = &sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_A];
                }
            }
            rcv_count1++;
        }
        rcv_count2++;
    }
    else if (SCI_EVT_RXBUF_OVFL == p_args->event)
    {
        nop();
        error_count1++;
    }
    else if (SCI_EVT_OVFL_ERR == p_args->event)
    {
        nop();
        error_count2++;
    }
    else if (SCI_EVT_FRAMING_ERR == p_args->event)
    {
        nop();
    }
    else if (SCI_EVT_PARITY_ERR == p_args->event)
    {
        nop();
    }
}

/***********************************************************************************************************************
* Function Name: my_flash_callback
***********************************************************************************************************************/
__STATIC void my_flash_callback(void *event)
{
    uint32_t event_code = FLASH_ERR_FAILURE;
    event_code          = *((uint32_t *)event);

    flash_error_code = FLASH_ERR_FAILURE;
    if ((event_code == FLASH_INT_EVENT_WRITE_COMPLETE) || (event_code == FLASH_INT_EVENT_ERASE_COMPLETE))
    {
        flash_error_code = FLASH_SUCCESS;
    }

    switch (secure_boot_state)
    {
        case BOOT_LOADER_STATE_BANK1_UPDATE_LIFECYCLE_ERASE_WAIT:
            secure_boot_state = BOOT_LOADER_STATE_BANK1_UPDATE_LIFECYCLE_ERASE_COMPLETE; break;
        case BOOT_LOADER_STATE_BANK1_UPDATE_LIFECYCLE_WRITE_WAIT:
            secure_boot_state = BOOT_LOADER_STATE_BANK1_UPDATE_LIFECYCLE_WRITE_COMPLETE; break;
        case BOOT_LOADER_STATE_BANK1_REFRESH_SECURE_BOOT_ERASE_WAIT:
            secure_boot_state = BOOT_LOADER_STATE_BANK1_REFRESH_SECURE_BOOT_ERASE_COMPLETE; break;
        case BOOT_LOADER_STATE_BANK1_REFRESH_SECURE_BOOT_WRITE_WAIT1:
            secure_boot_state = BOOT_LOADER_STATE_BANK1_REFRESH_SECURE_BOOT_WRITE_COMPLETE1; break;
        case BOOT_LOADER_STATE_BANK1_REFRESH_SECURE_BOOT_WRITE_WAIT2:
            secure_boot_state = BOOT_LOADER_STATE_BANK1_REFRESH_SECURE_BOOT_WRITE_COMPLETE2; break;
        case BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_WAIT:
            secure_boot_state = BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_COMPLETE; break;
        case BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_WAIT1:
            secure_boot_state = BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_COMPLETE1; break;
        case BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_WAIT2:
            secure_boot_state = BOOT_LOADER_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_COMPLETE2; break;
        case BOOT_LOADER_STATE_INSTALL_DATA_FLASH_ERASE_WAIT:
            secure_boot_state = BOOT_LOADER_STATE_INSTALL_DATA_FLASH_ERASE_COMPLETE; break;
        case BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_ERASE_WAIT:
            secure_boot_state = BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_ERASE_COMPLETE; break;
        case BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_WRITE_WAIT:
            secure_boot_state = BOOT_LOADER_STATE_BANK0_INSTALL_CODE_FLASH_WRITE_COMPLETE; break;
        case BOOT_LOADER_STATE_INSTALL_DATA_FLASH_WRITE_WAIT:
            secure_boot_state = BOOT_LOADER_STATE_INSTALL_DATA_FLASH_WRITE_COMPLETE; break;
        case BOOT_LOADER_STATE_BANK1_UPDATE_CODE_FLASH_ERASE_WAIT:
            secure_boot_state = BOOT_LOADER_STATE_BANK1_UPDATE_CODE_FLASH_ERASE_COMPLETE; break;
        default:
            break;
    }
}

/***********************************************************************************************************************
* Function Name: my_sw_charput_function
* Description  : Default char output: sends one byte over the configured SCI channel (+ LCD if enabled).
*                NOTE: this waits for the SCI TX queue to drain using the configured SCI channel TX buffer size.
***********************************************************************************************************************/
void my_sw_charput_function(uint8_t data)
{
    uint32_t arg = 0;
    do
    {
        R_SCI_Control(my_sci_handle, SCI_CMD_TX_Q_BYTES_FREE, (void *)&arg);
    } while (SCI_CFG_serial_term_TX_BUFSIZ != arg);
    R_SCI_Send(my_sci_handle, (uint8_t *)&data, 1);
#if RX_BOOTLOADER_USE_LCD
    R_SIMPLE_GRAPHIC_PutCharacter(data);
#endif
}

