HirokiIshiguro/iot-reference-rx/Projects/boot_loader_ck_rx65n/e2studio_ccrx/lib/rx_bootloader/rx_bootloader.c
/***********************************************************************************************************************
* Function Name: my_sw_charget_function
***********************************************************************************************************************/
void my_sw_charget_function(void)
{
}

/***********************************************************************************************************************
* Function Name: get_status_string
***********************************************************************************************************************/
__STATIC const uint8_t *get_status_string(uint8_t status)
{
    static const uint8_t status_string[][32] = {
        {"LIFECYCLE_STATE_BLANK"},
        {"LIFECYCLE_STATE_TESTING"},
        {"LIFECYCLE_STATE_INSTALLING"},
        {"LIFECYCLE_STATE_VALID"},
        {"LIFECYCLE_STATE_INVALID"},
        {"LIFECYCLE_STATE_UNKNOWN"},
    };
    const uint8_t *tmp;

    if (status == LIFECYCLE_STATE_BLANK)            tmp = status_string[0];
    else if (status == LIFECYCLE_STATE_TESTING)     tmp = status_string[1];
    else if (status == LIFECYCLE_STATE_INSTALLING)  tmp = status_string[2];
    else if (status == LIFECYCLE_STATE_VALID)       tmp = status_string[3];
    else if (status == LIFECYCLE_STATE_INVALID)     tmp = status_string[4];
    else                                            tmp = status_string[5];
    return tmp;
}

/***********************************************************************************************************************
* Function Name: firmware_verification_sha256_ecdsa
* Description  : Verifies ECDSA (P-256) signature over SHA-256 hash of the firmware body, using the PEM-encoded
*                public key supplied via the local_code_signer_public_key pointer.
***********************************************************************************************************************/
__STATIC int32_t firmware_verification_sha256_ecdsa(const uint8_t *pucData,
                                                    uint32_t       ulSize,
                                                    const uint8_t *pucSignature,
                                                    uint32_t       ulSignatureSize,
                                                    const uint8_t *local_code_signer_public_key)
{
    int32_t  xResult = -1;
    uint8_t  pucHash[TC_SHA256_DIGEST_SIZE];
    uint8_t  data_length;
    uint8_t  public_key[64];
    uint8_t  binary[256];
    uint8_t *head_pointer, *current_pointer, *tail_pointer;
    (void)ulSignatureSize;

    /* SHA256 hash of firmware body */
#if RX_BOOTLOADER_USE_PERF_COUNTER
    reset_10us_counter();
    start_10us_counter();
#endif
    {
        struct tc_sha256_state_struct xCtx;
        tc_sha256_init(&xCtx);
        tc_sha256_update(&xCtx, pucData, ulSize);
        tc_sha256_final(pucHash, &xCtx);
    }
#if RX_BOOTLOADER_USE_PERF_COUNTER
    stop_10us_counter();
    sha256_time = read_10us_counter() * 10;
#endif

    /* Extract public key from PEM-encoded blob */
    head_pointer = (uint8_t *)strstr((const char *)local_code_signer_public_key, "-----BEGIN PUBLIC KEY-----");
    if (head_pointer)
    {
        head_pointer += strlen("-----BEGIN PUBLIC KEY-----");
        tail_pointer = (uint8_t *)strstr((const char *)local_code_signer_public_key, "-----END PUBLIC KEY-----");
        base64_decode(head_pointer, binary, tail_pointer - head_pointer);
        current_pointer = binary;
        data_length     = *(current_pointer + 1);
        while (1)
        {
            switch (*current_pointer)
            {
                case 0x30: /* SEQUENCE */
                    current_pointer += 2;
                    break;
                case 0x03: /* BIT STRING (public key) */
                    if (*(current_pointer + 1) == 0x42)
                    {
                        memcpy(public_key, current_pointer + 4, 64);
#if RX_BOOTLOADER_USE_PERF_COUNTER
                        reset_10us_counter();
                        start_10us_counter();
#endif
                        if (uECC_verify(public_key, pucHash, TC_SHA256_DIGEST_SIZE, pucSignature, uECC_secp256r1()))
                        {
                            xResult = 0;
                        }
#if RX_BOOTLOADER_USE_PERF_COUNTER
                        stop_10us_counter();
                        ecdsa_time = read_10us_counter() * 10;
#endif
                    }
                    current_pointer += *(current_pointer + 1) + 2;
                    break;
                default:
                    current_pointer += *(current_pointer + 1) + 2;
                    break;
            }
            if ((current_pointer - binary) > data_length)
            {
                break;
            }
        }
    }
    return xResult;
}

#if RX_BOOTLOADER_USE_PERF_COUNTER
/***********************************************************************************************************************
* 10us performance counter (driven by r_cmt_rx periodic callback).
***********************************************************************************************************************/
void bootloader_software_timer_handler(void *arg)
{
    (void)arg;
    if (s_10us_counter_start_flag)
    {
        s_10us_counter++;
    }
}

__STATIC void     reset_10us_counter(void) { s_10us_counter = 0; }
__STATIC uint32_t read_10us_counter(void)  { return s_10us_counter; }
__STATIC void     start_10us_counter(void) { s_10us_counter_start_flag = 1; }
__STATIC void     stop_10us_counter(void)  { s_10us_counter_start_flag = 0; }
#endif /* RX_BOOTLOADER_USE_PERF_COUNTER */
